In [76]:
scores = [[11, 12, 13], [21, 22, 23]]

In [77]:
type(scores)

list

In [78]:
scores

[[11, 12, 13], [21, 22, 23]]

In [79]:
import numpy as np

In [80]:
score_array = np.array(scores)

In [81]:
type(score_array)

numpy.ndarray

In [82]:
score_array

array([[11, 12, 13],
       [21, 22, 23]])

In [83]:
score_array[0,1]

12

In [84]:
import pandas as pd

In [85]:
scores_columns = ["Korean", "English", "Math"]
scores_index = ["1_Class", "2_Class"]

In [86]:
df_scores = pd.DataFrame(score_array, index = scores_index, columns = scores_columns)

In [87]:
df_scores

         Korean  English  Math
1_Class      11       12    13
2_Class      21       22    23

In [88]:
df_scores[["Korean","English"]]

         Korean  English
1_Class      11       12
2_Class      21       22

In [89]:
df_scores.Korean

1_Class    11
2_Class    21
Name: Korean, dtype: int32

In [90]:
df_scores.dtypes

Korean     int32
English    int32
Math       int32
dtype: object

In [91]:
df_scores.iloc[:,:]

         Korean  English  Math
1_Class      11       12    13
2_Class      21       22    23

In [92]:
df_scores

         Korean  English  Math
1_Class      11       12    13
2_Class      21       22    23

In [93]:
type(df_scores)

pandas.core.frame.DataFrame

In [94]:
new_array = df_scores.values

In [95]:
new_list = new_array.tolist()

In [96]:
type(new_list)

list